controllers/PemesananController.php

    public function actionGetProduk(){
        $term = \Yii::$app->request->get('term');

        $produk = Produk::find()
        ->orFilterWhere(['like','idProduk',$term])
        ->orFilterWhere(['like','namaProduk',$term])
        ->limit(5)
        ->asArray()
        ->all();
---
SELECT * FROM `produk` WHERE (`idProduk` LIKE '%h%') OR (`namaProduk` LIKE '%h%') LIMIT 5